alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n"I don\'t much care where ——" said Alice.\n"Then it doesn\'t matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії (це вже було зроблено - символи \n присутні)
# task 02 == Знайдіть та екрануйте всі символи одинарної дужки у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
print(alice_in_wonderland)
print("\n")
"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
sq_black_sea = 436402
sq_azov_sea = 37800
summ = sq_azov_sea + sq_black_sea
print("Чорне та Азовське моря разом: " + summ.__str__() + " км2.")
print("\n")

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
x = 375291 # store1 + store2 + store3
y = 250449 # store1 + store2
z = 222950 # store2 + store3
store1 = x - z
store3 = x - y
store2 = x - (store1 + store3)
print("На першому складі: " + store1.__str__() + " товарів.")
print("На другому складі: " + store2.__str__() + " товарів.")
print("На третьому складі: " + store3.__str__() + " товарів.")
print("\n")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
months = 18 # a year and a half
pay = 1179
price = months * pay
print("вартість комп’ютера: " + price.__str__() + " грн/місяць.")
print("\n")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9

st_mod = [a, b, c, d, e, f]
print(st_mod)
print("\n")

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pizza_big_all = 274 * 4
pizza_mid_all = 218 * 2
juice_all = 35 * 4
pie = 350
water_all = 21 * 3

all_money = pizza_big_all + pizza_mid_all + juice_all + pie + water_all
print("замовлення коштує: " + all_money.__str__() + " грн.")
print("\n")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
photos = 232
place = 8
pages = photos/place
print("знадобиться " + pages.__str__() + " сторінок.")
print("\n")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance_all = 1600
distance_refill = 100
fuel_need = 9
fuel_all = 48

q = distance_all/distance_refill*fuel_need
print("знадобиться " + q.__str__() + " літрів бензину.")
w = q/fuel_all
print("необхідно заїхати на заправку " + w.__str__() + " рази.")




